def color(x):
    summ=0

    simbols = {1: ['а', 'и', 'с', 'ъ', 'a', 'j', 's'],
               2: ['б', 'й', 'т', 'ы', 'b', 'k', 't'],
               3: ['в', 'к', 'у', 'ь', 'c', 'l', 'u'],
               4: ['г', 'л', 'ф', 'э', 'd', 'm', 'v'],
               5: ['д', 'м', 'х', 'ю', 'e', 'n', 'w'],
               6: ['е', 'н', 'ц', 'я', 'f', 'o', 'x'],
               7: ['ё', 'о', 'ч', 'g', 'p', 'y'],
               8: ['ж', 'п', 'ш', 'h', 'q', 'z'],
               9: ['з', 'р', 'щ', 'i', 'r']}

    colors={1:'Красный',
            2:'Оранжевый',
            3:'Жёлтый',
            4:'Зелёный',
            5:'Голубой',
            6:'Синий',
            7:'Фиолетовый',
            8:'Розовый',
            9:'Золотой'}

    for i in simbols:
        for j in simbols.get(i):
            for n in x:
                if j == n:
                    summ+=i
    a=str(summ)
    b=0
    while len (a)>=2:
        for i in a:
            b+=int(i)
        a=str(b)
        b=0
    a=int(a)

    for i in colors:
        if i==a:
            return (colors.get(i))



